<!-- html部分 -->
<template>
	<div>
		<h1>企业能耗比对比图</h1>
		<ve-line :data="chartData"></ve-line>
		<h1>企业作业量对比图 (单位：万吨)</h1>
		<ve-histogram :data="chartData2"></ve-histogram>
	</div>
</template>
<!-- js部分 -->
<script>
	export default {
		name:'',
		data() {
			return {
				chartData: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 25, '漯河港': 32, '上海港': 38 },
					{ '月份': '2月', '周口港': 22, '漯河港': 19, '上海港': 23 },
					{ '月份': '3月', '周口港': 21, '漯河港': 17, '上海港': 32 },
					{ '月份': '4月', '周口港': 24, '漯河港': 16, '上海港': 35 },
					{ '月份': '5月', '周口港': 28, '漯河港': 14, '上海港': 40 },
					{ '月份': '6月', '周口港': 32, '漯河港': 20, '上海港': 26 },
					{ '月份': '7月', '周口港': 36, '漯河港': 21, '上海港': 24 },
					{ '月份': '8月', '周口港': 39, '漯河港': 23, '上海港': 21 }
					
				  ]
				},
				chartData2: {
				  columns: ['月份', '周口港', '漯河港', '上海港'],
				  rows: [
					{ '月份': '1月', '周口港': 25, '漯河港': 18, '上海港': 35 },
					{ '月份': '2月', '周口港': 22, '漯河港': 19, '上海港': 37 },
					{ '月份': '3月', '周口港': 21, '漯河港': 17, '上海港': 39 },
					{ '月份': '4月', '周口港': 24, '漯河港': 16, '上海港': 32 },
					{ '月份': '5月', '周口港': 28, '漯河港': 14, '上海港': 30 },
					{ '月份': '6月', '周口港': 32, '漯河港': 20, '上海港': 26 },
					{ '月份': '7月', '周口港': 36, '漯河港': 21, '上海港': 24 },
					{ '月份': '8月', '周口港': 39, '漯河港': 23, '上海港': 21 }
					
				  ]
				}
			};
		},
		methods:{
			
		}
	}
</script>
<!-- css部分 -->
<style>

</style>
